/*
練習題：求稅後工資問題
2019年1月1日起，國家推出新的個人所得稅政策，起徵點上調值5000元。
也就是說稅前工資扣除三險一金（三險一金數額假設是稅前工資的10%）後如果不足5000元，則不交稅。
如果大於5000元，那麼大於5000元的部分按梯度交稅，具體梯度比例如下：

​ 0 ~ 3000元的部分，交稅3%
​ 3000 ~ 12000元的部分，交稅10%
​ 12000 ~ 25000的部分， 交稅20%
​ 25000 ~ 35000的部分，交稅25%
​ 35000 ~ 55000的部分，交稅30%
​ 55000 ~ 80000的部分，交稅35%
​ 超過80000的部分，交稅45%

比如：小藍入職一家企業後，稅前工資是18000，則他每月該交個稅的部分是18000-1800-5000=11200元，
個稅繳納數額是3000×3%+8200×10%=910元。稅後工資15290元。
請完成一個個稅計算程序，在用戶輸入稅前工資後，計算出他對應的納稅數額，以及稅後工資為多少？
 */

package tw.online.test;

public class test16_XX {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
